#!/usr/bin/perl

$prog = $0 ;
$prog =~ s/\.pl// ;

@surf = (
  {'name' => 'mc', rusname => 'мнимый конус', 'eqn' => 'x^2+y^2+z^2=0',
    'r' => 3, 'rp' => 3, 'rm' => 0, 'type' => 2, 'a' => 0
  },
  {'name' => 'me', rusname => 'мнимый эллипсоид', 'eqn' => 'x^2+y^2+z^2+1=0',
    'r' => 3, 'rp' => 3, 'rm' => 0, 'type' => 2, 'a' => 1
  },
  {'name' => 'e', rusname => 'эллипсоид', 'eqn' => 'x^2+y^2+z^2-1=0',
    'r' => 3, 'rp' => 3, 'rm' => 0, 'type' => 2, 'a' => -1
  },
  {'name' => 'c', rusname => 'конус', 'eqn' => 'x^2+y^2-z^2=0',
    'r' => 3, 'rp' => 2, 'rm' => 1, 'type' => 2, 'a' => 0
  },
  {'name' => 'dg', rusname => 'двуполостный гиперболоид', 'eqn' => 'x^2+y^2-z^2+1=0',
    'r' => 3, 'rp' => 2, 'rm' => 1, 'type' => 2, 'a' => 1
  },
  {'name' => 'og', rusname => 'однополостный гиперболоид', 'eqn' => 'x^2+y^2-z^2-1=0',
    'r' => 3, 'rp' => 2, 'rm' => 1, 'type' => 2, 'a' => -1
  },
  {'name' => 'ep', rusname => 'эллиптический параболоид', 'eqn' => 'x^2+y^2+z=0',
    'r' => 2, 'rp' => 2, 'rm' => 0, 'type' => 1
  },
  {'name' => 'gp', rusname => 'гиперболический параболоид', 'eqn' => 'x^2-y^2+z=0',
    'r' => 2, 'rp' => 1, 'rm' => 1, 'type' => 1
  },
  {'name' => 'pmip', rusname => 'пара мнимых пересекающихся плоскостей', 'eqn' => 'x^2+y^2=0',
    'r' => 2, 'rp' => 2, 'rm' => 0, 'type' => 2, 'a' => 0
  },
  {'name' => 'mec', rusname => 'мнимый эллиптический цилиндр', 'eqn' => 'x^2+y^2+1=0',
    'r' => 2, 'rp' => 2, 'rm' => 0, 'type' => 2, 'a' => 1
  },
  {'name' => 'ec', rusname => 'эллиптический цилиндр', 'eqn' => 'x^2+y^2-1=0',
    'r' => 2, 'rp' => 2, 'rm' => 0, 'type' => 2, 'a' => -1
  },
  {'name' => 'gc', rusname => 'гиперболический цилиндр', 'eqn' => 'x^2-y^2+1=0',
    'r' => 2, 'rp' => 1, 'rm' => 1, 'type' => 2, 'a' => 1
  },
  {'name' => 'pip', rusname => 'пара пересекающихся плоскостей', 'eqn' => 'x^2-y^2=0',
    'r' => 2, 'rp' => 1, 'rm' => 1, 'type' => 2, 'a' => 0
  },
  {'name' => 'pc', rusname => 'параболический цилиндр', 'eqn' => 'x^2+y=0',
    'r' => 1, 'rp' => 1, 'rm' => 0, 'type' => 1
  },
  {'name' => 'ppp', rusname => 'пара паралельных плоскостей', 'eqn' => 'x^2-1=0',
    'r' => 1, 'rp' => 1, 'rm' => 0, 'type' => 2, 'a' => -1
  },
  {'name' => 'pmpp', rusname => 'пара мнимых паралельных плоскостей', 'eqn' => 'x^2+1=0',
    'r' => 1, 'rp' => 1, 'rm' => 0, 'type' => 2, 'a' => 1
  },
  {'name' => 'psp', rusname => 'пара совпадающих плоскостей', 'eqn' => 'x^2=0',
    'r' => 1, 'rp' => 1, 'rm' => 0, 'type' => 2, 'a' => 0
  }
) ;
$num = int(rand(17)) ;
if ( $num>12 && rand()>0.3) {$num = int(rand(17)) ;} ;
%s = %{$surf[$num]} ;
print STDERR "Ответ:\n\nПоверхность: $s{'rusname'}\n\n" ;
print STDERR "Канонический вид: \$ $s{'eqn'} \$\n\n" ;
print STDERR "ранг: $s{'r'}, сигнатура: ($s{'rp'}, $s{'rm'})\n\n" ;

$string  = "$s{'r'} $s{'rm'} $s{'type'} " ;
$string .= "$s{'a'}" if $s{'type'} == 2 ;
print `echo "$string" | $prog` ;

for $key (keys %s) {
    print "\n\%$key=\n\%$s{$key}\n"
}

